.emacs.d/emacs-config.org
#+title: Emacs configuration
#+author: Philippe Gabriel
#+PROPERTY: header-args:emacs-lisp :tangle ~/.emacs.d/init.el

* Startup

** Performance measurements

Here we check reduce threshold for garbage collector to improve performanceand check for the startup time.

#+begin_src emacs-lisp

  (setq gc-cons-threshold (* 50 1000 1000)) ; Sets garbage collection threshold high enough

#+end_src

Below is a sectioned configuration of emacs. Each code blocks gets written out to the ~~/.emacs~ config file.

** Server initialization

Starting a server for displaying polybar info

#+begin_src emacs-lisp

  (server-start)

#+end_src

* Basic UI Configuration

** UI settings

#+begin_src emacs-lisp

  (setq inhibit-startup-message t)                                   ; Disable startup message
  (setq scroll-conservatively 1000)                                  ; Slow scrolling
  (scroll-bar-mode 0)                                                ; Disable visible scrollbar
  (tool-bar-mode 0)                                                  ; Disable toolbar
  (tooltip-mode 0)
  (menu-bar-mode 0)                                                  ; Disable menu bar
  (setq split-width-threshold 185)                                   ; Width for splitting
  (global-set-key (kbd "M-<tab>") 'other-window)                     ; Bind alt tab to buffer switching


  ;; Set frame transparency
  (set-frame-parameter (selected-frame) 'alpha '(100 . 100))
  (add-to-list 'default-frame-alist '(alpha . (90 . 90)))
  (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
  (add-to-list 'default-frame-alist '(fullscreen . maximized))

#+end_src

** Editing experience

#+begin_src emacs-lisp

  (require 'iso-transl)
  (define-key global-map (kbd "<Multi_key>") iso-transl-ctl-x-8-map) ; Bind compose key in case emacs captures it

  (setq tab-width 4)                    ; Set tab length
  (setq custom-buffer-indent 2)
  (setq-default indent-tabs-mode nil)   ; Disable tab caracter
  (show-paren-mode 1)                   ; Enable delimiters matching
  (save-place-mode 1)                   ; Remembers last cursor placement in file
  (column-number-mode)                  ; Show column numbers
  (mouse-avoidance-mode 'banish)        ; No mouse allowed
  (global-display-line-numbers-mode 1)  ; Show line numbers
  (setq display-line-numbers-type 'relative)
  (setq-default fill-column 80)         ; 80 caracter column indicator
  (add-hook 'prog-mode-hook 'display-fill-column-indicator-mode)
  (add-hook 'compilation-filter-hook
            (lambda () (ansi-color-apply-on-region (point-min) (point-max))))


  (dolist (mode '(org-mode-hook         ; Disable line numbers for some modes
                  term-mode-hook
                  coming-mode-hook
                  gfm-view-mode-hook
                  compilation-mode-hook
                  eshell-mode-hook
                  sql-interactive-mode-hook
                  pdf-view-mode-hook
                  sokoban-mode-hook
                  doc-view-mode-hook
                  mu4e-main-mode-hook
                  Man-mode-hook
                  simple-mpc-mode-hook
                  treemacs-mode-hook
                  vterm-mode-hook
                  slack-mode-hook
                  shell-mode-hook))
    (add-hook mode (lambda() (display-line-numbers-mode 0))))

#+end_src

** Fonts

#+begin_src emacs-lisp

  (set-face-attribute 'default nil :font "Fira Code Retina" :height 120)
  (set-face-attribute 'fixed-pitch nil :font "Fira Code Retina")
  (set-face-attribute 'variable-pitch nil :font "DejaVu Sans" :weight 'regular)

  (set-face-attribute 'italic nil
                      :slant 'italic 
                      :underline nil)

#+end_src

** Window placement management

#+begin_src emacs-lisp

  (setq display-buffer-base-action
        '(display-buffer-reuse-mode-window
          display-buffer-reuse-window
          display-buffer-same-window))

  ;; If a popup does happen, don't resize windows to be equal-sized
  (setq even-window-sizes nil)

#+end_src

* Temporary Files Management

Some settings to manage where emacs stores backup files (such as the ~~~ backup files).

#+begin_src emacs-lisp

  (setq backup-directory-alist `(("." . ,(expand-file-name "tmp/backups/" user-emacs-directory))))
  (setq auto-save-list-file-prefix (expand-file-name "tmp/auto-saves/sessions/" user-emacs-directory)
        auto-save-file-name-transforms `((".*" ,(expand-file-name "tmp/auto-saves/" user-emacs-directory) t)))

#+end_src

* Packages

Some initializations are first set up.

#+begin_src emacs-lisp

  ;; (require 'package) ; Initialize package sources

  ;; (setq package-archives '(("melpa" . "https://melpa.org/packages/")
  ;;                          ("org" . "https://orgmode.org/elpa/")
  ;;                          ("elpa" . "https://elpa.gnu.org/packages/")))
  ;; (package-initialize)
  ;; (setq package-enable-at-startup nil)
  ;; (unless package-archive-contents
  ;;   (package-refresh-contents))

  ;; (unless (package-installed-p 'use-package) 
  ;;   (package-install 'use-package))

  ;; (require 'use-package)
  ;; (setq use-package-always-ensure t)

  (defvar bootstrap-version)
  (let ((bootstrap-file "~/Packages/straight/repos/straight.el/bootstrap.el")
        (bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))
  
  (straight-use-package 'use-package)
  (setq straight-use-package-by-default t)
  ;;(setq use-package-verbose t) For optimizing performance

#+end_src

** Password utilities

*** Package | auth-source

#+begin_src emacs-lisp

  (use-package auth-source
    :straight nil
    :custom
    (auth-sources '("~/.authinfo.gpg")))

#+end_src

*** Package | pinentry

#+begin_src emacs-lisp

  (use-package pinentry
    :custom
    (epg-pinentry-mode 'loopback)
    :config
    (pinentry-start))

#+end_src

*** Package | password-cache

#+begin_src emacs-lisp

  (use-package password-cache
    :straight nil
    :custom
    (password-cache-expiry (* 60 60 2)))

#+end_src

*** Password lookup

#+begin_src emacs-lisp

  (defun pg/lookup-password (&rest keys)
    (let ((result (apply #'auth-source-search keys)))
      (if result
          (funcall (plist-get (car result) :secret))
        nil)))

#+end_src

** Keybind Log

*** Package | keycast

Useful when starting out with the various keybindings and when presenting to an audience.

#+begin_src emacs-lisp

  (define-minor-mode pg/keycast-mode
    "Show current command and its key binding in the mode line (fix for use with doom-mode-line)."
    :global t
    (interactive)
    (if pg/keycast-mode
        (add-hook 'pre-command-hook 'keycast--update t)
      (remove-hook 'pre-command-hook 'keycast--update)))

  (use-package keycast
    :custom
    (keycast-mode-line-format "%2s%k%c%2s")
    :config
    (fset #'keycast-mode #'pg/keycast-mode)
    (keycast-mode)
    (add-to-list 'global-mode-string '("" keycast-mode-line)))

#+end_src

** Command Completion Framework

*** Package | savehist

#+begin_src emacs-lisp

  (use-package savehist
    :straight nil
    :custom
    (savehist-mode))

#+end_src

*** Package | marginalia

#+begin_src emacs-lisp

  (use-package marginalia
    :straight t
    :after vertico
    :custom
    (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
    :config
    (marginalia-mode))

#+end_src

*** Package | consult

#+begin_src emacs-lisp

  (use-package consult
    :straight t
    :bind
    ("C-s" . consult-line)
    ("C-x b" . consult-buffer)
    (:map minibuffer-local-map
          ("C-r" . consult-history)))

#+end_src

*** Package | orderless

#+begin_src emacs-lisp

  (use-package orderless
    :straight t
    :custom
    (completion-styles '(orderless))
    (completion-category-defaults nil)
    (orderless-skip-highlighting nil)
    (completion-category-overrides '((file (styles basic partial-completion)))))

#+end_src

*** Package | corfu

#+begin_src emacs-lisp

  (use-package corfu
    :straight t
    :bind
    (:map corfu-map
          ("C-j" . corfu-next)
          ("C-k" . corfu-previous))
    :custom
    (corfu-cycle t)
    :config
    (corfu-global-mode))

#+end_src

*** Package | vertico

#+begin_src emacs-lisp

  (use-package vertico
    :straight t
    :bind
    (:map vertico-map
          ("C-j" . vertico-next)
          ("C-k" . vertico-previous))
    :custom
    (vertico-cycle t)
    :init
    (vertico-mode))

#+end_src

