.emacs.d/emacs-config.org
*** Package | embark

#+begin_src emacs-lisp

  (use-package embark
    :straight t
    :bind
    ("C-S-a" . embark-act)
    (:map minibuffer-local-map
          ("C-d" . embark-act))
    :custom
    (embark-confirm-act-all nil)
    :config
    (setq embark-action-indicator
          (lambda (map)
            (which-key--show-keymap "Embark" map nil nil 'no-paging)
            #'which-key--hide-popup-ignore-command)
          embark-become-indicator embark-action-indicator))

#+end_src

*** Package | embark-consult

#+begin_src emacs-lisp

  (use-package embark-consult
    :straight '(embark-consult :host github
                               :repo "oantolin/embark"
                               :files ("embark-consult.el"))
    :after (embark consult)
    :demand t
    :hook
    (embark-collect-mode . embark-consult-preview-minor-mode))

#+end_src

*** Package | app-launcher

#+begin_src emacs-lisp

  (use-package app-launcher
    :straight '(app-launcher
                :host github
                :repo "SebastienWae/app-launcher"))

#+end_src

*** Package | prescient

#+begin_src emacs-lisp

  (use-package prescient
    :straight t)

#+end_src

*** Package | which-key

Displays additional keybindings subsequent to prefix keybindings

#+begin_src emacs-lisp

  (use-package which-key
    :diminish which-key-mode
    :config
    (which-key-mode)
    (setq which-key-idle-delay 1)) ; Delay before popup in seconds

#+end_src

*** Package | helm

#+begin_src emacs-lisp

  (use-package helm
    :after lsp-java
    :bind
    (:map helm-map
          ("C-k" . helm-previous-line)
          ("C-j" . helm-next-line))
    :config
    (helm-mode 1))

#+end_src

** UI Enhancement

*** Package | diminish

#+begin_src emacs-lisp

  (use-package diminish
    :straight t)

#+end_src

*** Package | all-the-icons

#+begin_src emacs-lisp

  (use-package all-the-icons)

#+end_src

*** Package | ligature

#+begin_src emacs-lisp

  (use-package ligature
    :straight nil
    :load-path "~/Packages/ligature.el"
    :config
    ;; Enable ligatures
    (ligature-set-ligatures 't '("++" "--" "/=" "&&" "||" "||=" "->" "=>" "::" "__" "==" "===" "!=" "=/=" "!=="
                                 "<=" ">=" "<=>" "/*" "*/" "//" "///" "\\n" "\\\\" "<<" "<<<" "<<=" ">>" ">>>" ">>="
                                 "|=" "^=" "**" "?." "</" "<!--" "</>" "-->" "/>" "www" "##" "###" "####" "#####"
                                 "######" "--" "---" "----" "-----" "------" "====" "=====" "======" "[]" "<>" "<~>"
                                 "??" ".." "..." "=~" "!~" ":=" "..<" "!!" ":::" "=!=" "=:=" "<:<" "..=" "::<"
                                 "#{" "#(" "#_" "#_(" "#?" "#:" ".-" ";;" "~@" "<-" "#{}" "|>" "=>>" "=<<" ">=>" "<=<"
                                 "=>=" "=<=" "<$" "<$>" "$>" "<+" "<+>" "+>" "<*" "<*>" "*>" "<|>" ".=" "#=" "+++" "***"
                                 ":>:" ":<:" "<|||" "<||" "<|" "||>" "|||>" "[|" "|]" "~-" "~~" "%%" "/\\" "\\/" "-|" "_|"
                                 "_|_" "|-" "||-" ":>" ":<" ">:" "<:" "::>" "<::" ">::" "{|" "|}" "#[" "]#" "::="
                                 "#!" "#=" "->>" ">-" ">>-" "->-" "->>-" "=>>=" ">>->" ">>=>" "|->" "|=>" "~>" "~~>" "//=>"
                                 "<<-" "-<" "-<<" "-||" "-<-" "-<<-" "=<" "=|" "=||" "=<<=" "<-<<" "<=<<" "<-|" "<=|" "<~"
                                 "<~~" "<=//" "<->" "<<=>>" "|-|-|" "|=|=|" "/=/"))

    (global-ligature-mode 't))

#+end_src

*** Package | doom-modeline

Customizes the look of the modeline for better aesthetic.

#+begin_src emacs-lisp

  (use-package doom-modeline
    :straight t
    :init (doom-modeline-mode 1)
    :custom
    (doom-modeline-height 15)
    (doom-modeline-modal-icon nil)
    (doom-modeline-enable-word-count t)
    (doom-modeline-indent-info t)
    (doom-modeline-mu4e t))

#+end_src

*** Package | autothemer

Important to disable current theme ~M-x disable-theme~ in order to experiment.

#+begin_src emacs-lisp

  (use-package autothemer
    :config
    (load-theme 'onedark-variant t))

#+end_src

*** Package | dashboard

#+begin_src emacs-lisp

  (defun pg/dashboard-setup-startup-hook ()
    "Setup post initialization hooks."
    (add-hook 'after-init-hook (lambda ()
                                 ;; Display useful lists of items
                                 (dashboard-insert-startupify-lists)))
    (add-hook 'emacs-startup-hook (lambda ()
                                    (switch-to-buffer dashboard-buffer-name)
                                    (goto-char (point-min))
                                    (redisplay)
                                    (run-hooks 'dashboard-after-initialize-hook))))

  (defun pg/display-startup-time ()
    (let ((package-count 0) (time (float-time (time-subtract after-init-time before-init-time))))
      (when (boundp 'straight--profile-cache)
        (setq package-count (+ (hash-table-count straight--profile-cache) package-count)))
      (if (zerop package-count)
          (format "Emacs started in %.2f" time)
        (format "%d packages loaded in %.2f seconds with %d garbage collections" package-count time gcs-done))))

  (use-package dashboard
    :straight t
    :custom
    (dashboard-set-file-icons t)
    (dashboard-items '((recents . 10)
                       (projects . 10)
                       (agenda . 5)))
    (dashboard-init-info #'pg/display-startup-time)

    :config
    (fset #'dashboard-setup-startup-hook #'pg/dashboard-setup-startup-hook)
    (pg/dashboard-setup-startup-hook))

#+end_src

*** Package | page-break-lines

#+begin_src emacs-lisp

  (use-package page-break-lines)

#+end_src

** Window Management

*** Package | bufler

#+begin_src emacs-lisp

  (use-package bufler
    :straight t
    :after evil-collection
    :bind ("C-x C-b" . bufler)
    :config
    (evil-collection-define-key 'normal 'bufler-list-mode-map
      (kbd "RET")   'bufler-list-buffer-switch
      (kbd "M-RET") 'bufler-list-buffer-peek
      "D"           'bufler-list-buffer-kill)

    (setf bufler-groups
          (bufler-defgroups

           ;; Subgroup collecting all named workspaces.
           (group (auto-workspace))

           ;; Subgroup collecting buffers in a projectile project.
           (group (auto-projectile))

           ;; Grouping browser windows
           (group
            (group-or "Browsers"
                      (name-match "Firefox" (rx bos "firefox"))))

           (group
            (group-or "Chat"
                      (name-match "Discord" (rx bos "discord"))
                      (mode-match "Slack" (rx bos "slack-"))))

           (group
            ;; Subgroup collecting all `help-mode' and `info-mode' buffers.
            (group-or "Help/Info"
                      (mode-match "*Help*" (rx bos (or "help-" "helpful-")))
                      (mode-match "*Info*" (rx bos "info-"))))

           (group
            ;; Subgroup collecting all special buffers (i.e. ones that are not
            ;; file-backed), except `magit-status-mode' buffers (which are allowed to fall
            ;; through to other groups, so they end up grouped with their project buffers).
            (group-and "*Special*"
                       (name-match "**Special**"
                                   (rx bos "*" (or "Messages" "Warnings" "scratch" "Backtrace" "Pinentry") "*"))
                       (lambda (buffer)
                         (unless (or (funcall (mode-match "Magit" (rx bos "magit-status"))
                                              buffer)
                                     (funcall (mode-match "Dired" (rx bos "dired"))
                                              buffer)
                                     (funcall (auto-file) buffer))
                           "*Special*"))))

           ;; Group remaining buffers by major mode.
           (auto-mode))))

#+end_src

*** Package | winner-mode

For window configurations

#+begin_src emacs-lisp

  (use-package winner
    :straight nil
    :config
    (winner-mode))

#+end_src

*** Package | tab-bar mode

#+begin_src emacs-lisp

  (use-package tab-bar
    :custom
    (tab-bar-show 1)
    :config
    (tab-bar-mode))

#+end_src

*** Package | perspective

For organizing the buffer list

#+begin_src emacs-lisp

  (use-package perspective
    :straight t
    :bind
    ("C-x k" . persp-kill-buffer*)
    :config
    (unless (equal persp-mode t) (persp-mode)))

#+end_src

** Email Management

