.emacs.d/init.el
    :straight '(mu :type git
                   :host github
                   :branch "release/1.6"
                   :repo "djcb/mu"
                   :files ("mu4e/*")
                   :pre-build (("./autogen.sh") ("make")))
    :commands mu4e
    ;; :load-path "/usr/local/share/emacs/site-lisp/mu4e"
    :config
    (require 'mu4e-org)
    ;; This is set to 't' to avoid mail syncing issues when using mbsync
    (setq mu4e-change-filenames-when-moving t)

    ;; Refresh mail using isync every 10 minutes
    (setq mu4e-update-interval (* 10 60))
    (setq mu4e-get-mail-command "mbsync -a")
    (setq mu4e-maildir "~/Mail")
    (setq message-send-mail-function 'smtpmail-send-it)
    (setq mu4e-compose-format-flowed t)
    (setq mu4e-compose-signature
          (concat "Philippe Gabriel - \n[[mailto:philippe.gabriel.1@umontreal.ca][philippe.gabriel.1@umontreal.ca]] | "
                  "[[mailto:pgabriel999@hotmail.com][pgabriel999@hotmail.com]]"))
    (setq mu4e-compose-signature-auto-include nil)

    (setq mu4e-contexts
          (list
           ;; Main account
           (make-mu4e-context
            :name "Main"
            :match-func
            (lambda (msg)
              (when msg
                (string-prefix-p "/Main" (mu4e-message-field msg :maildir))))
            :vars '((user-mail-address . "pgabriel999@hotmail.com")
                    (user-full-name . "Philippe Gabriel")
                    (smtpmail-smtp-server . "smtp.office365.com")
                    (smtpmail-smtp-user . "pgabriel999@hotmail.com")
                    (smtpmail-smtp-service . 587)
                    (smtpmail-stream-type . starttls)
                    (mu4e-drafts-folder . "/Main/Drafts")
                    (mu4e-sent-folder . "/Main/Sent")
                    (mu4e-refile-folder . "/Main/Archive")
                    (mu4e-trash-folder . "/Main/Deleted")))

           ;; University account
           (make-mu4e-context
            :name "University"
            :match-func
            (lambda (msg)
              (when msg
                (string-prefix-p "/University" (mu4e-message-field msg :maildir))))
            :vars '((user-mail-address . "philippe.gabriel.1@umontreal.ca")
                    (user-full-name . "Philippe Gabriel")
                    (smtpmail-smtp-server . "smtp.office365.com")
                    (smtpmail-smtp-user . "philippe.gabriel.1@umontreal.ca")
                    (smtpmail-smtp-service . 587)
                    (smtpmail-stream-type . starttls)
                    (mu4e-drafts-folder . "/University/Drafts")
                    (mu4e-sent-folder . "/University/Sent Items")
                    (mu4e-refile-folder . "/University/Archive")
                    (mu4e-trash-folder . "/University/Deleted Items")))))

    (setq mu4e-maildir-shortcuts
          '(("/University/Inbox" . ?u)
            ("/University/Drafts" . ?d)
            ("/Main/Inbox" . ?m)
            ("/Main/Jobs" . ?j)
            ("/Main/University" . ?s)))
    (mu4e t)
    :custom
    (mu4e-context-policy 'pick-first)
    (mu4e-mu-binary (expand-file-name "mu/mu" (straight--repos-dir "mu")))
    ;; (setq mu4e-bookmarks
    ;;       '((:name "Display Name" :query "Query" :key "Key" ...)))
    ))

(unless pg/is-termux
  (straight-use-package 'mu4e-alert)
  (use-package mu4e-alert
    :after mu4e
    :custom
    (mu4e-alert-notify-repeated-mails t)
    :config
    (mu4e-alert-set-default-style 'notifications)
    (mu4e-alert-enable-notifications)
    (mu4e-alert-enable-mode-line-display)))

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

(use-package abbrev
  :straight nil
  :diminish abbrev-mode)

(use-package highlight-indent-guides
  :hook (prog-mode . highlight-indent-guides-mode)
  :custom 
  (highlight-indent-guides-responsive 'stack)
  (highlight-indent-guides-method 'character))

(use-package undo-fu)

(use-package smartparens
  :diminish smartparens-mode
  :config
  (smartparens-global-mode))

(with-eval-after-load 'smartparens
  (sp-with-modes
      '(smartparens-mode)
    (sp-local-pair "{" nil :post-handlers '(:add ("||\n[i]" "RET")))))

(use-package outshine
  :straight nil
  :hook (prog-mode . outshine-mode)
  :config
  (unbind-key "M-<up>" 'outshine-mode-map)
  (unbind-key "M-<down>" 'outshine-mode-map)
  (unbind-key "<normal-state> [ [" 'outline-mode-map)
  (unbind-key "<normal-state> ] ]" 'outline-mode-map)
  (unbind-key "C-c @ C-p" 'outline-minor-mode-map)
  (unbind-key "C-c @ C-n" 'outline-minor-mode-map)
  (unbind-key "<normal-state> C-k" 'outline-mode-map)
  (unbind-key "<normal-state> C-j" 'outline-mode-map)
  :bind (:map outline-minor-mode-map
              ("C-j" . outline-next-visible-heading)
              ("C-k" . outline-previous-visible-heading)))

(defun pg/selectric-type-sound ()
  "Make the sound of the printing element hitting the paper."
  (progn
    (selectric-make-sound (format "%sselectric-move.wav" selectric-files-path))
    (unless (minibufferp)
      (if (= (current-column) (current-fill-column))
          (selectric-make-sound (format "%sping.wav" selectric-files-path))))))

(use-package selectric-mode
  :config
  (fset #'selectric-type-sound #'pg/selectric-type-sound))

(use-package rainbow-mode
  :diminish rainbow-mode
  :hook ((org-mode
          emacs-lisp-mode
          web-mode
          typescript-mode
          css-mode
          scss-mode
          less-css-mode) . rainbow-mode))

(use-package emojify)

(use-package helpful
  :commands (helpful-callable helpful-variable helpful-command helpful-key)
  :bind
  ([remap describe-function] . helpful-callable)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . helpful-variable)
  ([remap describe-key] . helpful-key))

(use-package dired
  :straight nil
  :after evil-collection
  :commands (dired dired-jump)
