.emacs.d/emacs-config.org
*** Package | dired

The built-in directory editor. Some basic useful keybindings to keep in mind:
- ~j~ / ~k~ - Next / Previous line
- ~J~ - Jump to file in buffer
- ~RET~ - Select file or directory
- ~^~ - Go to parent directory
- ~g O~ - Open file in other window
- ~g o~ - Open file in other window in preview mode, which can be closed with ~q~
- ~M-RET~ - Show file in other window without focusing (previewing)

Keybindings relative to marking (selecting) in dired:
- ~m~ - Marks a file
- ~u~ - Unmarks a file
- ~U~ - Unmarks all files in buffer
- ~t~ - Inverts marked files in buffer
- ~% m~ - Mark files in buffer using regular expression
- ~*~ - Lots of other auto-marking functions
- ~K~ - "Kill" marked items, removed from the view only (refresh buffer with ~g r~ to get them back)
Many operations can be done on a single file if there are no active marks.

Keybindings relative to copying and renaming files:
- ~C~ - Copy marked files (or if no files are marked, the current file)
- ~R~ - Rename marked files
- ~% R~ - Rename based on regular expression

Keybindings relative to deleting files:
- ~D~ - Delete marked file
- ~d~ - Mark file for deletion
- ~x~ - Execute deletion for marks
- ~delete-by-moving-to-trash~ - Move to trash instead of deleting permanently if set to true

Keybindings relative to archives and compressing:
- ~Z~ - Compress or uncompress a file or folder to (.tar.gz)
- ~c~ - Compress selection to a specific file
- ~dired-compress-files-alist~ - Bind compression commands to file extension by adding additional extensions to the list

Keybindings for other useful operations:
- ~T~ - Touch (change timestamp)
- ~M~ - Change file mode
- ~O~ - Change file owner
- ~G~ - Change file group
- ~S~ - Create a symbolic link to this file
- ~L~ - Load an Emacs Lisp file into Emacs
  
 #+begin_src emacs-lisp

   (use-package dired
     :straight nil
     :after evil-collection
     :commands (dired dired-jump)
     :bind (("C-x C-j" . dired-jump)) ; Open dired at current directory
     :config
     (evil-collection-define-key 'normal 'dired-mode-map
       "h" 'dired-single-up-directory
       "l" 'dired-single-buffer)
     :custom ((dired-listing-switches "-agho --group-directories-first")))

#+end_src

*** Package | dired-single

Keeps a single dired buffer open at a time (to not have multiple buried buffers).

#+begin_src emacs-lisp

  (use-package dired-single
    :straight t
    :after dired
    :commands (dired dired-jump))

#+end_src

*** Package | all-the-icons-dired

Displays icons in dired-mode.

#+begin_src emacs-lisp

  (use-package all-the-icons-dired
    :hook (dired-mode . all-the-icons-dired-mode))

#+end_src

*** Package | dired-hide-dotfiles

Togglable option for hiding dot files.

#+begin_src emacs-lisp

  (use-package dired-hide-dotfiles
    :after evil-collection
    :hook (dired-mode . dired-hide-dotfiles-mode)
    :config
    (evil-collection-define-key 'normal 'dired-mode-map
      "H" 'dired-hide-dotfiles-mode))

#+end_src

** Shell customization

*** Package | eshell-git-prompt

Adds more detail to the prompt in eshell with custome themes.

#+begin_src emacs-lisp

  (defun pg/eshell-git-prompt-multiline ()
    "Eshell Git prompt inspired by spaceship-prompt."
    (let (separator hr dir git git-dirty time sign command)
      (setq separator (with-face " | " 'eshell-git-prompt-multiline-secondary-face))
      (setq hr (with-face (concat "\n" (make-string (/ (window-total-width) 2) ?─) "\n") 'eshell-git-prompt-multiline-secondary-face))
      (setq dir
            (concat
             (with-face " " 'eshell-git-prompt-directory-face)
             (concat  (abbreviate-file-name (eshell/pwd)))))
      (setq git
            (concat (with-face "⎇" 'eshell-git-prompt-exit-success-face)
                    (concat (eshell-git-prompt--branch-name))))
      (setq git-dirty
            (when (eshell-git-prompt--branch-name)
              (if (eshell-git-prompt--collect-status)
                  (with-face " ✎" 'eshell-git-prompt-modified-face)
                (with-face " ✔" 'eshell-git-prompt-exit-success-face))))
      (setq time (with-face (format-time-string "%I:%M:%S %p") 'eshell-git-prompt-multiline-secondary-face))
      (setq sign
            (if (= (user-uid) 0)
                (with-face "\n#" 'eshell-git-prompt-multiline-sign-face)
              (with-face "\nλ" 'eshell-git-prompt-multiline-sign-face)))
      (setq command (with-face " " 'eshell-git-prompt-multiline-command-face))

      ;; Build prompt
      (concat hr dir separator git git-dirty separator time sign command)))

  (use-package eshell-git-prompt
    :after eshell
    :config
    (fset #'eshell-git-prompt-multiline #'pg/eshell-git-prompt-multiline))

#+end_src

*** Package | eshell

Some configurations to the built-in eshell.

#+begin_src emacs-lisp

  (defun pg/config-path ()
    (let ((paths '("/home/phil-gab99/miniconda3/bin"
                   "/home/phil-gab99/miniconda3/condabin"
                   "/opt/pulsesecure/bin"
                   "/home/phil-gab99/bin"
                   "/home/phil-gab99/Visual_Paradigm_16.3/bin"
                   "/home/phil-gab99/yakindu-sctpro"
                   "/home/phil-gab99/PIPEv4.3.0"
                   "/home/phil-gab99/.dotnet"
                   "/home/phil-gab99/.cabal/bin"
                   "/home/phil-gab99/.ghcup/bi")))
      (dolist (path paths)
        (add-to-list 'exec-path path))))

  (defun pg/configure-eshell ()
    ;; Save command history when commands are entered
    (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

    ;; Truncate buffer for performance
    (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

    ;; Bind some useful keys for evil-mode
    (evil-define-key '(normal insert visual) eshell-mode-map (kbd "<home>") 'eshell-bol)
    (evil-normalize-keymaps)

    (local-unset-key (kbd "M-<tab>"))
    (corfu-mode)

    (setq eshell-history-size 10000
          eshell-buffer-maximum-lines 10000
          eshell-hist-ignoredups t
          eshell-scroll-to-bottom-on-input t))

  (require 'em-tramp)
  (use-package eshell
    :straight nil
    :hook (eshell-first-time-mode . pg/configure-eshell)
    :custom
    (eshell-prefer-lisp-functions t)
    :config
    (pg/config-path)
    (eshell-git-prompt-use-theme 'multiline))

#+end_src

*** Package | vterm

#+begin_src emacs-lisp

  (use-package vterm)

#+end_src

** Project Management and Version Control

*** Package | projectile

Allows for git projects management. Accessed using the ~C-c p~ prefix. Some important notes:
- ~C-c p E~ - Allows creation of a local dirs dot file for pre-defining the values for some important other projectile variables.
  - If variables have not been set after this change then evaluate (~M-:~) the following function ~(hack-dir-local-variables)~.
- ~C-c p s r~ - Allows for use of the ~ripgrep~ command across the current reopository. Useful along with ~C-c C-o~ to pop out the results from the minibuffer into another buffer.
Note that the emacs built-in local dir creation can also be used and is more flexible.

#+begin_src emacs-lisp

  (use-package projectile
    :diminish projectile-mode
    :hook (lsp-mode . projectile-mode)
    :custom ((projectile-completion-system 'vertico))
    :init
    (setq projectile-keymap-prefix (kbd "C-c p"))
    (when (file-directory-p "~/Projects")
      (setq projectile-project-search-path '("~/Projects")))
    (setq projectile-switch-project-action #'projectile-dired))

  (bind-keys*
   :map prog-mode-map
   ("C-p c" . projectile-run-project)
   ("C-p b" . projectile-compile-project))

#+end_src

*** Package | magit

Allows for git commands to be applied to the current repository using the command ~C-x g~ which invokes a ~git status~ command with some additional information. Typing ~?~ invokes a list of possible commands, typing ~?~ again invokes the help function for the different commands and typing ~?~ a third time invokes the manual for the package.

#+begin_src emacs-lisp

  (use-package magit
    :commands (magit-status magit-get-current-branch)
    :config
    (unbind-key "M-<tab>" 'magit-mode-map)
    (unbind-key "M-<tab>" 'magit-section-mode-map)
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

#+end_src

