.emacs.d/init.el
  :bind (("C-x C-j" . dired-jump)) ; Open dired at current directory
  :config
  (evil-collection-define-key 'normal 'dired-mode-map
    "h" 'dired-single-up-directory
    "l" 'dired-single-buffer)
  :custom ((dired-listing-switches "-agho --group-directories-first")))

(use-package dired-single
  :straight t
  :after dired
  :commands (dired dired-jump))

(unless pg/is-termux
  (use-package all-the-icons-dired
    :hook (dired-mode . all-the-icons-dired-mode)))

(use-package dired-hide-dotfiles
  :after evil-collection
  :hook (dired-mode . dired-hide-dotfiles-mode)
  :config
  (evil-collection-define-key 'normal 'dired-mode-map
    "H" 'dired-hide-dotfiles-mode))

(defun pg/eshell-git-prompt-multiline ()
  "Eshell Git prompt inspired by spaceship-prompt."
  (let (separator hr dir git git-dirty time sign command)
    (setq separator (with-face " | " 'eshell-git-prompt-multiline-secondary-face))
    (setq hr (with-face (concat "\n" (make-string (/ (window-total-width) 2) ?─) "\n") 'eshell-git-prompt-multiline-secondary-face))
    (setq dir
          (concat
           (with-face " " 'eshell-git-prompt-directory-face)
           (concat  (abbreviate-file-name (eshell/pwd)))))
    (setq git
          (concat (with-face "⎇" 'eshell-git-prompt-exit-success-face)
                  (concat (eshell-git-prompt--branch-name))))
    (setq git-dirty
          (when (eshell-git-prompt--branch-name)
            (if (eshell-git-prompt--collect-status)
                (with-face " ✎" 'eshell-git-prompt-modified-face)
              (with-face " ✔" 'eshell-git-prompt-exit-success-face))))
    (setq time (with-face (format-time-string "%I:%M:%S %p") 'eshell-git-prompt-multiline-secondary-face))
    (setq sign
          (if (= (user-uid) 0)
              (with-face "\n#" 'eshell-git-prompt-multiline-sign-face)
            (with-face "\nλ" 'eshell-git-prompt-multiline-sign-face)))
    (setq command (with-face " " 'eshell-git-prompt-multiline-command-face))

    ;; Build prompt
    (concat hr dir separator git git-dirty separator time sign command)))

(use-package eshell-git-prompt
  :after eshell
  :config
  (fset #'eshell-git-prompt-multiline #'pg/eshell-git-prompt-multiline))

(defun pg/config-path ()
  (let ((paths '("/home/phil-gab99/miniconda3/bin"
                 "/home/phil-gab99/miniconda3/condabin"
                 "/opt/pulsesecure/bin"
                 "/home/phil-gab99/bin"
                 "/home/phil-gab99/Visual_Paradigm_16.3/bin"
                 "/home/phil-gab99/yakindu-sctpro"
                 "/home/phil-gab99/PIPEv4.3.0"
                 "/home/phil-gab99/.dotnet"
                 "/home/phil-gab99/.cabal/bin"
                 "/home/phil-gab99/.ghcup/bi")))
    (dolist (path paths)
      (add-to-list 'exec-path path))))

(defun pg/configure-eshell ()
  ;; Save command history when commands are entered
  (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

  ;; Truncate buffer for performance
  (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

  ;; Bind some useful keys for evil-mode
  (evil-define-key '(normal insert visual) eshell-mode-map (kbd "<home>") 'eshell-bol)
  (evil-normalize-keymaps)

  (local-unset-key (kbd "M-<tab>"))
  (corfu-mode)

  (setq eshell-history-size 10000
        eshell-buffer-maximum-lines 10000
        eshell-hist-ignoredups t
        eshell-scroll-to-bottom-on-input t))

(require 'em-tramp)
(use-package eshell
  :straight nil
  :hook (eshell-first-time-mode . pg/configure-eshell)
  :custom
  (eshell-prefer-lisp-functions t)
  :config
  (pg/config-path)
  (eshell-git-prompt-use-theme 'multiline))

(use-package vterm)

(use-package projectile
  :diminish projectile-mode
  :hook (lsp-mode . projectile-mode)
  :custom ((projectile-completion-system 'vertico))
  :init
  (setq projectile-keymap-prefix (kbd "C-c p"))
  (when (file-directory-p "~/Projects")
    (setq projectile-project-search-path '("~/Projects")))
  (setq projectile-switch-project-action #'projectile-dired))

(bind-keys*
 :map prog-mode-map
 ("C-p c" . projectile-run-project)
 ("C-p b" . projectile-compile-project))

(use-package magit
  :commands (magit-status magit-get-current-branch)
  :config
  (unbind-key "M-<tab>" 'magit-mode-map)
  (unbind-key "M-<tab>" 'magit-section-mode-map)
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))
