.emacs.d/emacs-config.org
*** Package | git-gutter

#+begin_src emacs-lisp

  (use-package git-gutter
    :straight git-gutter-fringe
    :diminish git-gutter-mode
    :hook ((text-mode . git-gutter-mode)
           (prog-mode . git-gutter-mode))
    :custom
    (git-gutter:added-sign nil)
    (git-gutter:modified-sign nil)
    (git-gutter:deleted-sign nil)
    (git-gutter-fr:side 'right-fringe)
    :config
    (require 'git-gutter-fringe)
    (set-face-foreground 'git-gutter-fr:added "LightGreen")
    (fringe-helper-define 'git-gutter-fr:added nil
                          "XXXXXXXXXX"
                          "XXXXXXXXXX"
                          "XXXXXXXXXX"
                          ".........."
                          ".........."
                          "XXXXXXXXXX"
                          "XXXXXXXXXX"
                          "XXXXXXXXXX"
                          ".........."
                          ".........."
                          "XXXXXXXXXX"
                          "XXXXXXXXXX"
                          "XXXXXXXXXX")

    (set-face-foreground 'git-gutter-fr:modified "LightGoldenrod")
    (fringe-helper-define 'git-gutter-fr:modified nil
                          "XXXXXXXXXX"
                          "XXXXXXXXXX"
                          "XXXXXXXXXX"
                          ".........."
                          ".........."
                          "XXXXXXXXXX"
                          "XXXXXXXXXX"
                          "XXXXXXXXXX"
                          ".........."
                          ".........."
                          "XXXXXXXXXX"
                          "XXXXXXXXXX"
                          "XXXXXXXXXX")

    (set-face-foreground 'git-gutter-fr:deleted "LightCoral")
    (fringe-helper-define 'git-gutter-fr:deleted nil
                          "XXXXXXXXXX"
                          "XXXXXXXXXX"
                          "XXXXXXXXXX"
                          ".........."
                          ".........."
                          "XXXXXXXXXX"
                          "XXXXXXXXXX"
                          "XXXXXXXXXX"
                          ".........."
                          ".........."
                          "XXXXXXXXXX"
                          "XXXXXXXXXX"
                          "XXXXXXXXXX")

    ;; These characters are used in terminal mode
    (set-face-foreground 'git-gutter:added "LightGreen")
    (set-face-foreground 'git-gutter:modified "LightGoldenrod")
    (set-face-foreground 'git-gutter:deleted "LightCoral"))

#+end_src

*** Package | forge

Adds git forges to magit.
Steps to get working:
- Run ~forge pull~ at the current git repo
- 

#+begin_src emacs-lisp

  (use-package forge
    :after magit)

#+end_src

** IDE Functionalities 

*** Package | lsp-mode

Language Server Protocol for basic IDE functionalities. See [[https://emacs-lsp.github.io/lsp-mode/page/languages/][here]] for how to setup for different languages.
The ~lsp=ui-doc-focus-frame~ command allows to access the documentation frame of the pop-up.

#+begin_src emacs-lisp

  (defun pg/lsp-mode-setup () ; Displays structure of cursor position for all buffers
    (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
    (lsp-headerline-breadcrumb-mode))

  (straight-use-package 'lsp-mode)
  (require 'lsp-completion)
  (use-package lsp-mode
    :commands (lsp lsp-deferred)
    :hook (lsp-mode . pg/lsp-mode-setup)
    :init
    (setq lsp-keymap-prefix "C-c l")
    :config
    (lsp-enable-which-key-integration t)
    :custom
    (lsp-completion-provider :none))

#+end_src

*** Package | lsp-ui

Displays useful doc on hover.

#+begin_src emacs-lisp

  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode)
    :custom
    (lsp-ui-doc-position 'bottom)
    (lsp-ui-doc-show-with-cursor t))

#+end_src

*** Package | lsp-treemacs

Tree views in emacs.

#+begin_src emacs-lisp

  (use-package lsp-treemacs
    :after lsp)

#+end_src

*** Package | company

For auto-completions while coding.

#+begin_src emacs-lisp

  (defvar company-mode/enable-yas t
    "Enable yasnippet for all backends.")

  (defun company-mode/backend-with-yas (backend)
    (if (or (not company-mode/enable-yas) (and (listp backend) (member 'company-yasnippet backend)))
        backend
      (append (if (consp backend) backend (list backend))
              '(:with company-yasnippet))))

  (use-package company
    :after lsp-mode
    :hook (prog-mode . company-mode)
    :bind
    (:map company-active-map
          ("<tab>" . company-complete-selection))
    (:map lsp-mode-map
          ("<tab>" . company-indent-or-complete-common))
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.0)
    (company-tooltip-minimum-width 40)
    (company-tooltip-maximum-width 60)
    :config
    (setq company-backends (mapcar #'company-mode/backend-with-yas company-backends)))

#+end_src

*** Package | company-box

Includes icons for company mode suggestions.

#+begin_src emacs-lisp

  (use-package company-box
    :straight t
    :after company
    :hook (company-mode . company-box-mode))

#+end_src

*** Package | company-prescient

Remembers autocomplete selections.

#+begin_src emacs-lisp

  (use-package company-prescient
    :after company
    :config
    (company-prescient-mode 1))

#+end_src

*** Package | flycheck

Syntax checking.

#+begin_src emacs-lisp

  (use-package flycheck
    :hook (lsp-mode . flycheck-mode))

#+end_src

*** Package | dap-mode

Debugger Adaptor Protocol for IDE debugging commands. See [[https://emacs-lsp.github.io/dap-mode/page/configuration/][here]] for how to setup for different languages.

#+begin_src emacs-lisp

  (use-package dap-mode
    :after lsp-mode
    :config
    (dap-mode 1)
    (dap-ui-mode 1)
    (dap-ui-controls-mode 1))


  ;;(general-define-key
  ;;  :keymaps 'lsp-mode-map
  ;;  :prefix lsp-keymap-prefix
  ;;  "d" '(dap-hydra t :wk "debugger")))

#+end_src

*** Package | plantuml-mode

Allows writing textual descriptions for creating uml diagrams

#+begin_src emacs-lisp

  (use-package plantuml-mode
    :custom
    (plantuml-indent-level 4)
    (plantuml-jar-path "~/bin/plantuml.jar")
    (plantuml-default-exec-mode 'jar))

#+end_src

*** Languages

**** Alloy

#+begin_src emacs-lisp

  (use-package alloy-mode
    :straight nil
    :hook (alloy-mode . (lambda () (setq indent-tabs-mode nil)))
    :load-path "~/.emacs.d/extrapkgs/alloy-mode"
    :custom
    (alloy-basic-offset 4))

#+end_src

**** C/C++/Objective-C

#+begin_src emacs-lisp

  (require 'lsp-clangd)
  (use-package cc-mode
    :straight nil
    :config
    (setq c-basic-offset 4)
    :custom
    (lsp-clangd-binary-path "~/.emacs.d/lsp-servers/clangd_13.0.0/bin/clangd")
    (lsp-clangd-version "13.0.0")
    (company-clang-executable "/usr/lib/clang")
    :hook ((c-mode c++-mode objc-mode) . lsp-deferred))

#+end_src

***** Package | company-c-headers

#+begin_src emacs-lisp

  (use-package company-c-headers
    :after (cc-mode company)
    :config
    (add-to-list 'company-backends '(company-c-headers :with company-yasnippet)))

#+end_src

**** Common Lisp

***** Package | slime

#+begin_src emacs-lisp

  (use-package sly
    :custom
    (inferior-lisp-program "sbcl"))

#+end_src

**** Css/LessCSS/SASS/SCSS

***** Package | lsp-css

#+begin_src emacs-lisp

  (use-package lsp-css
    :straight nil
    :hook ((css-mode less-css-mode scss-mode) . lsp-deferred))

#+end_src

**** Docker

#+begin_src emacs-lisp

  (use-package dockerfile-mode)

#+end_src

**** Git

#+begin_src emacs-lisp

  (use-package git-modes)

#+end_src

**** Groovy

#+begin_src emacs-lisp

  (use-package groovy-mode
    :straight '(groovy-emacs-modes :type git
                                   :host github
                                   :repo "Groovy-Emacs-Modes/groovy-emacs-modes"))

#+end_src

**** Haskell

#+begin_src emacs-lisp

  (use-package haskell-mode
    :hook ((haskell-mode haskell-literate-mode) . lsp-deferred))

#+end_src

***** Package | lsp-haskell

#+begin_src emacs-lisp

  (use-package lsp-haskell
    :custom
    (lsp-haskell-server-path "~/.ghcup/bin/haskell-language-server-8.10.6"))

#+end_src

**** Java

***** Package | lsp-java

#+begin_src emacs-lisp

  (use-package lsp-java
    :hook (java-mode . lsp-deferred)
    :bind
    (:map lsp-mode-map
          ("C-<return>" . lsp-execute-code-action))
    :config
    (require 'dap-java)
    :custom
    (lsp-enable-file-watchers nil)
    (lsp-java-configuration-runtimes '[( :name "JavaSE-17"
                                         :path "/usr/lib/jvm/java-17-openjdk-amd64"
                                         :default t)])
    (lsp-java-vmargs (list "-noverify" "--enable-preview"))
    (lsp-java-java-path "/usr/lib/jvm/java-17-openjdk-amd64/bin/java")
    (lsp-java-import-gradle-home "/opt/gradle/latest/bin/gradle")
    (lsp-java-import-gradle-java-home "/usr/lib/jvm/java-17-openjdk-amd64/bin/java")
    (lsp-java-server-install-dir "/home/phil-gab99/.emacs.d/lsp-servers/java-language-server/bin/"))

#+end_src

***** Package | gradle-mode

#+begin_src emacs-lisp

  (defun pg/gradle-run ()
    "Execute gradle run command"
    (interactive)
    (gradle-run "run"))

  (use-package gradle-mode
    :hook (java-mode . gradle-mode)
    :straight '(emacs-gradle-mode
                :host github
                :repo "jacobono/emacs-gradle-mode"))

#+end_src

