.emacs.d/emacs-config.org
**** LaTeX

#+begin_src emacs-lisp

  (straight-use-package 'auctex)
  (require 'tex-site)
  (use-package tex
    :straight auctex
    :config
    (add-to-list 'auto-mode-alist '("\\.tex$" . LaTeX-mode))
    (add-hook 'TeX-after-compilation-finished-functions #'TeX-revert-document-buffer)
    (add-hook 'TeX-mode-hook (lambda () (run-hooks 'prog-mode-hook)))
    (put 'TeX-mode 'derived-mode-parent 'prog-mode)
    :custom
    (TeX-view-program-selection '((output-pdf "PDF Tools")))
    (TeX-source-correlate-start-server t))

#+end_src

***** Package | company-auctex

#+begin_src emacs-lisp

  (use-package company-auctex
    :after (auctex company)
    :config
    (add-to-list 'company-backends '(company-auctex :with company-yasnippet)))

#+end_src

**** LMC

Custom syntax highlighting for LMC assembly language.

***** Custom LMC

#+begin_src emacs-lisp

  (defvar lmc-java-mode-hook nil)

  (add-to-list 'auto-mode-alist '("\\.lmc\\'" . lmc-mode))

  (defconst lmc-java-font-lock-defaults
    (list
     '("#.*" . font-lock-comment-face)
     '("\\<\\(ADD\\|BR[PZ]?\\|DAT\\|HLT\\|IN\\|LDA\\|OUT\\|S\\(?:TO\\|UB\\)\\)\\>" . font-lock-keyword-face)
     '("^\\w+" . font-lock-function-name-face)
     '("\\b[0-9]+\\b" . font-lock-constant-face))
    "Minimal highlighting expressions for lmc mode")

  (defvar lmc-java-mode-syntax-table
    (let ((st (make-syntax-table)))
      (modify-syntax-entry ?# ". 1b" st)
      (modify-syntax-entry ?\n "> b" st)
      st)
    "Syntax table for lmc-mode")

  (define-derived-mode lmc-java-mode prog-mode "LMC"
    "Major mode for editing lmc files"
    :syntax-table lmc-mode-syntax-table

    (set (make-local-variable 'font-lock-defaults) '(lmc-font-lock-defaults))

    (setq-local comment-start "# ")
    (setq-local comment-end "")

    (setq-local indent-tabs-mode nil))

#+end_src

***** Lispy LMC

#+begin_src emacs-lisp

  (defun pg/lmc-setup ()
    (setq-local comment-start "# ")
    (setq-local comment-end "")
    (setq-local indent-tabs-mode nil)
    (setq-local tab-width 8)
    (setq-local indent-tabs-mode nil))

  (use-package lmc
    :hook (lmc-mode . pg/lmc-setup))

#+end_src

**** Markdown

#+begin_src emacs-lisp

  (use-package markdown-mode
    :straight nil
    :hook (gfm-view-mode . (lambda () (setq-local face-remapping-alist '((default (:height 1.5) variable-pitch)
                                                                         (markdown-code-face (:height 1.5) fixed-pitch))))))

#+end_src

**** MIPS

#+begin_src emacs-lisp

  (use-package mips-mode
    :mode "\\.asm\\'"
    :custom
    (mips-tab-width 4))
  
#+end_src

**** NuSMV

#+begin_src emacs-lisp

  (use-package nusmv-mode
    :straight nil
    :load-path "~/.emacs.d/extrapkgs/nusmv-mode"
    :mode "\\.smv\\'"
    :bind*
    (:map nusmv-mode-map
          ("C-c C-c" . nusmv-run))
    (:map nusmv-m4-mode-map
          ("C-c C-c" . nusmv-run))
    :custom
    (nusmv-indent 4)
    :config
    (menu-bar-mode 0)
    (add-hook 'nusmv-mode-hook (lambda () (run-hooks 'prog-mode-hook)))
    (put 'nusmv-mode 'derived-mode-parent 'prog-mode))

#+end_src

**** Python

#+begin_src emacs-lisp

  (use-package python-mode
    :hook (python-mode . lsp-deferred)
    :custom
    ;;(python-shell-interpreter "python3")
    ;;(dap-python-executable "python3")
    (dap-python-debugger 'debugpy)
    :config
    (require 'dap-python))

#+end_src

***** Package | lsp-python-ms

#+begin_src emacs-lisp

  (use-package lsp-python-ms
    :init (setq lsp-python-ms-auto-install-server t)
    :custom
    (lsp-python-ms-executable
     "~/.emacs.d/lsp-servers/python-language-server/output/bin/Release/linux-x64/publish/Microsoft.Python.LanguageServer")
    :hook (python-mode . (lambda () (require 'lsp-python-ms) (lsp-deferred))))

#+end_src

***** Package | jupyter

#+begin_src emacs-lisp

  (use-package jupyter)

#+end_src

**** SMTLibv2

#+begin_src emacs-lisp

  (use-package z3-mode)

#+end_src

**** SQL

#+begin_src emacs-lisp

  (use-package sql
    :hook (sql-mode . lsp-deferred)
    :config
    (add-hook 'sql-interactive-mode-hook (lambda () (toggle-truncate-lines t)))
    :custom
    ;; (sql-postgres-login-params '((user :default "phil-gab99")
    ;;                              (database :default "phil-gab99")
    ;;                              (server :default "localhost")
    ;;                              (port :default 5432)))

    (sql-connection-alist
     '((main (sql-product 'postgres)
             (sql-port 5432)
             (sql-server "localhost")
             (sql-user "phil-gab99")
             (sql-password (pg/lookup-password :host "localhost" :user "phil-gab99" :port 5432))
             (sql-database "phil-gab99"))
       (school (sql-product 'postgres)
               (sql-port 5432)
               (sql-server "localhost")
               (sql-user "phil-gab99")
               (sql-password (pg/lookup-password :host "localhost" :user "phil-gab99" :port 5432))
               (sql-database "ift2935"))))

    (lsp-sqls-server "~/go/bin/sqls")
    (setq lsp-sqls-connections
     (list
      (list
       (cl-pairlis '(driver dataSourceName)
                   (list '("postgresql") (concat "host=127.0.0.1 port=5432 user=phil-gab99 password="
                                          (pg/lookup-password :host "localhost" :user "phil-gab99" :port 5432)
                                          " dbname=phil-gab99 sslmode=disable")))
       (cl-pairlis '(driver dataSourceName)
                   (list '("postgresql") (concat "host=127.0.0.1 port=5432 user=phil-gab99 password="
                                          (pg/lookup-password :host "localhost" :user "phil-gab99" :port 5432)
                                          " dbname=ift2935 sslmode=disable")))))))

#+end_src

***** Package | sql-indent

#+begin_src emacs-lisp

  (use-package sql-indent
    :hook (sql-mode . sqlind-minor-mode)
    :config
    (setq-default sqlind-basic-offset 4))

#+end_src

**** TypeScript

#+begin_src emacs-lisp

  (use-package typescript-mode
    :mode "\\.ts\\'"
    :hook (typescript-mode . lsp-deferred)
    :config
    (require 'dap-node)
    (dap-node-setup))
  
#+end_src

**** VHDL

***** Package | vhdl-tools

#+begin_src emacs-lisp

  (flycheck-define-checker vhdl-tool
    "A VHDL syntax checker, type checker and linter using VHDL-Tool."
    :command ("vhdl-tool" "client" "lint" "--compact" "--stdin" "-f" source)
    :standard-input t
    :modes (vhdl-mode)
    :error-patterns
    ((warning line-start (file-name) ":" line ":" column ":w:" (message) line-end)
     (error line-start (file-name) ":" line ":" column ":e:" (message) line-end)))

  (use-package vhdl-tools
    :hook (vhdl-mode . lsp-deferred)
    :custom
    (lsp-vhdl-server-path "~/.emacs.d/lsp-servers/vhdl-tool")
    :config
    (add-to-list 'flycheck-checkers 'vhdl-tool))

#+end_src

**** YAML

#+begin_src emacs-lisp

  (use-package yaml-mode)

#+end_src

*** Package | comment-dwin-2

#+begin_src emacs-lisp

  (use-package comment-dwim-2
    :bind
    ("M-/" . comment-dwim-2)
    (:map org-mode-map
          ("M-/" . org-comment-dwim-2)))

#+end_src

*** Package | yasnippet

Allows for code snippets for different languages.

#+begin_src emacs-lisp

  (use-package yasnippet
    :diminish yas-minor-mode
    :straight t
    :hook (prog-mode . yas-minor-mode)
    :config
    (yas-global-mode 1)
    (add-hook 'yas-minor-mode-hook (lambda ()
                                     (yas-activate-extra-mode 'fundamental-mode))))

#+end_src

*** Package | yasnippet-snippets

Collection of code snippets for yasnippet.

#+begin_src emacs-lisp

  (use-package yasnippet-snippets
    :after yasnippet
    :straight t)
  
#+end_src

** Notification

*** Package | alert

#+begin_src emacs-lisp

  (use-package alert
    :custom
    (alert-default-style 'notifications))

#+end_src

** Org Mode

