.emacs.d/emacs-config.org
*** Package | org

Org mode package for writing structured documents and more. Here are some useful things to know about org files.
- ~#+title: Title~ - Sets the title of a document.
- ~M-left~ / ~M-right~ - Promotes/Demotes position of headers and bullet points.
- ~M-up~ / ~M-down~ - Moves the line above or below its current position, respecting the rank.
- ~S-right~ / ~S-left~ - Cycles through different states of headers and bullet points.
- ~M-RET~ - Adds another entry below the current header/bullet point of the same rank. 
- ~C-RET~ - Adds another entry after the current section occupied by the current header of the same rank.
  
Version issues with download can be fixed by manually getting the package from the package list.

#+begin_src emacs-lisp

  (defun org-screenshot ()
    "Take a screenshot into a time stamped unique-named file in the same directory as the org-buffer and insert a link to this file."
    (interactive)
    (setq filename
          (concat
           (make-temp-name
            (concat (buffer-file-name)
                    "_"
                    (format-time-string "%Y%m%d_%H%M%S_")) ) ".png"))
    (call-process "import" nil nil nil filename)
    (insert (concat "[[" filename "]]"))
    (org-display-inline-images))

  ;; Insert a file and convert it to an org table
  (defun org-csv-to-table (beg end)
    "Insert a file into the current buffer at point, and convert it to an org table."
    (interactive (list (mark) (point)))
    (org-table-convert-region beg end ","))

  ;; Function for defining some behaviours for the major org-mode
  (defun pg/org-mode-setup ()
    (org-indent-mode)
    (variable-pitch-mode 1)
    (auto-fill-mode 0)
    (visual-line-mode 1)
    (diminish org-indent-mode)
    (setq evil-auto-indent nil))

  (use-package org
    ;;:pin org
    ;;:straight org-plus-contrib
    :commands (org-capture org-agenda)
    :hook (org-mode . pg/org-mode-setup)
    :config
    (set-face-attribute 'org-ellipsis nil :underline nil)
    (setq org-ellipsis " ▾")
    (setq org-agenda-files ; Files considered by org-agenda
          '("~/Documents/Org/Agenda/"
            "~/Documents/Org/Recurrent/"))
    (setq org-hide-emphasis-markers t)
    (setq org-agenda-start-with-log-mode t)
    (setq org-log-done 'time)
    (setq org-log-into-drawer t)
    (setq org-deadline-warning-days 7)
    (setq org-todo-keywords ; Defines a new sequence for TODOs, can add more sequences
          '((sequence "TODO(t)" "ACTIVE(a)" "REVIEW(v)" "WAIT(w)" "HOLD(h)" "|"
                      "COMPLETED(c)" "CANC(k)")))

    (setq org-agenda-custom-commands ; Custom org-agenda commands
          '(("d" "Dashboard"
             ((agenda "" ((org-deadline-warning-days 7)))
              (todo "TODO"
                    ((org-agenda-overriding-header "Tasks")))
              (tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active Tasks")))))

            ("Z" "TODOs"
             ((todo "TODO"
                    ((org-agenda-overriding-header "Todos")))))

            ("m" "Misc" tags-todo "other")

            ("s" "Schedule" agenda ""
             ((org-agenda-files '("~/Documents/Org/Agenda/Schedule-S5.org")))
             ("~/Documents/Schedule-S5.pdf"))

            ("w" "Work Status"
             ((todo "WAIT"
                    ((org-agenda-overriding-header "Waiting")
                     (org-agenda-files org-agenda-files)))
              (todo "REVIEW"
                    ((org-agenda-overriding-header "In Review")
                     (org-agenda-files org-agenda-files)))
              (todo "HOLD"
                    ((org-agenda-overriding-header "On Hold")
                     (org-agenda-todo-list-sublevels nil)
                     (org-agenda-files org-agenda-files)))
              (todo "ACTIVE"
                    ((org-agenda-overriding-header "Active")
                     (org-agenda-files org-agenda-files)))
              (todo "COMPLETED"
                    ((org-agenda-overriding-header "Completed")
                     (org-agenda-files org-agenda-files)))
              (todo "CANC"
                    ((org-agenda-overriding-header "Cancelled")
                     (org-agenda-files org-agenda-files)))))))

    (setq org-capture-templates
          `(("t" "Tasks / Projects")
            ("tt" "Task" entry (file+olp "~/Documents/Org/Agenda/Tasks.org" "Active")
             "* TODO %?\n  DEADLINE: %U\n  %a\n  %i" :empty-lines 1)

            ("j" "Meetings")
            ("jm" "Meeting" entry (file+olp "~/Documents/Org/Agenda/Tasks.org" "Waiting")
             "* TODO %? \n SCHEDULED: %U\n" :empty-lines 1)

            ("m" "Email Workflow")
            ("mr" "Follow Up" entry (file+olp "~/Documents/Org/Agenda/Mail.org" "Follow up")
             "* TODO %a\nDEADLINE: %U%?\n %i" :empty-lines 1)))

    (setq org-format-latex-options (plist-put org-format-latex-options :scale 1.5))

    (setq org-agenda-exporter-settings
          '((ps-left-header (list 'org-agenda-write-buffer-name))
            (ps-right-header
             (list "/pagenumberstring load"
                   (lambda () (format-time-string "%d/%m/%Y"))))
            (ps-font-size '(12 . 11))       ; Lanscape . Portrait
            (ps-top-margin 55)
            (ps-left-margin 35)
            (ps-right-margin 30)))
    :custom

    (org-link-frame-setup '((vm . vm-visit-folder-other-frame)
                            (vm-imap . vm-visit-imap-folder-other-frame)
                            (gnus . org-gnus-no-new-news)
                            (file . find-file)
                            (wl . wl-other-frame)))
    (org-plantuml-jar-path "~/bin/plantuml.jar"))

#+end_src

*** Package | org-appear

Toggles visibility of emphasis markers.

#+begin_src emacs-lisp

  (use-package org-appear
    :hook (org-mode . org-appear-mode))

#+end_src

*** Package | org-bullets

Customizes the heading bullets.

#+begin_src emacs-lisp

  (use-package org-bullets
    :hook (org-mode . org-bullets-mode)
    :custom
    (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

#+end_src

*** Package | org-tree-slide

Allows for creation of slideshow presentations in emacs with org mode. The ~org-beamer-export-to-pdf~ command can be used to export the presentation as a pdf file - it requires ~pdflatex~. More detail [[https://orgmode.org/worg/exporters/beamer/tutorial.html][here]].

#+begin_src emacs-lisp

  (defun pg/diminish-all ()
    (diminish 'which-key-mode)
    (diminish 'org-indent-mode)
    (diminish 'auto-revert-mode)
    (diminish 'buffer-face-mode)
    (diminish 'visual-line-mode))

  (defun pg/presentation-setup ()
    (org-display-inline-images)
    (pg/diminish-all)
    (setq-local doom-modeline-minor-modes t)
    (setq-local org-format-latex-options (plist-put org-format-latex-options :scale 2.5))
    (setq-local face-remapping-alist '((default (:height 1.25) default)
                                       (header-line (:height 4.5) variable-pitch)
                                       (variable-pitch (:height 1.25) variable-pitch)
                                       (org-table (:height 1.5) org-table)
                                       (org-verbatim (:height 1.5) org-verbatim)
                                       (org-code (:height 1.5) org-code)
                                       (org-block (:height 1.5) org-block)))
    (variable-pitch-mode 1))

  (defun pg/presentation-end ()
    (variable-pitch-mode 0)
    (setq-local doom-modeline-minor-modes nil)
    (setq-local org-format-latex-options (plist-put org-format-latex-options :scale 1.5))
    (org-latex-preview)
    (setq-local face-remapping-alist '((default variable-pitch default))))

  (use-package org-tree-slide
    :hook (((org-tree-slide-before-move-next org-tree-slide-before-move-previous) . org-latex-preview)
           (org-tree-slide-play . pg/presentation-setup)
           (org-tree-slide-stop . pg/presentation-end))
    :after org
    :bind*
    (:map org-tree-slide-mode-map
          ("C-j" . org-tree-slide-move-next-tree)
          ("C-k" . org-tree-slide-move-previous-tree))
    :config
    ;; (unbind-key "<normal-state> C-j" 'org-mode-map)
    ;; (unbind-key "<normal-state> C-k" 'org-mode-map)
    ;; (unbind-key "C->" 'org-tree-slide-mode-map)
    ;; (unbind-key "C-<" 'org-tree-slide-mode-map)
    :custom
    (org-tree-slide-activate-message "Presentation started")
    (org-tree-slide-deactivate-message "Presentation ended")
    (org-tree-slide-breadcrumbs " > ")
    (org-tree-slide-header t)
    (org-image-actual-width nil))

#+end_src

