.emacs.d/emacs-config.org
*** Package | ox-reveal

#+begin_src emacs-lisp

  (use-package ox-reveal
    :custom
    (org-reveal-root "https://cdn.jsdelivr.net/npm/reveal.js"))

#+end_src

*** Package | org-notify

Handles notifications of scheduled tasks.

#+begin_src emacs-lisp

  (straight-use-package 'org-notify)
  (use-package org-notify
    :straight nil
    :after org
    :custom
    (user-mail-address "philippe.gabriel.1@umontreal.ca")
    :config
    (org-notify-start)
    (setq org-notify-map nil)
    (org-notify-add 'default '(:time "1w" :actions -notify/window :period "1h" :duration 5))
    (org-notify-add 'meeting '(:time "1w" :actions -email :period "1d")))

  ;; (org-notify-add 'appt
  ;;                 '(:time "-1s" :period "20s" :duration 10 :actions (-message -ding))
  ;;                 '(:time "15m" :period "2m" :duration 100 :actions -notify)
  ;;                 '(:time "2h" :period "5m" :actions -message)
  ;;                 '(:time "3d" :actions -email))
  ;;

#+end_src

*** Package | org-mime

Allows for editing an email in org mode

#+begin_src emacs-lisp

  (use-package org-mime
    :straight t
    :after org-msg)

#+end_src

*** Package | org-msg

Allows for markup language when composing email

#+begin_src emacs-lisp

  (setq mail-user-agent 'mu4e-user-agent)
  (use-package org-msg
    :straight t
    :after mu4e
    :custom
    (org-msg-options "html-postamble:nil toc:nil author:nil num:nil \\n:t")
    (org-msg-startup "indent inlineimages hidestars")
    (org-msg-greeting-fmt "\nBonjour/Hi%s,\n\n")
    ;; (org-msg-recipient-names '(("user@domain.com" . "Name")))
    (org-msg-greeting-name-limit 3)
    (org-msg-default-alternatives '((new . (text utf-8 html org))
                                    (reply-to-html . (text org html))
                                    (reply-to-text . (text org))))
    (org-message-convert-citation t)
    (org-msg-signature (concat "\n\nCordialement/Regards,\n\n*--*\n" mu4e-compose-signature))
    :config
    (org-msg-mode))

#+end_src

*** Package | org-roam

Helps with note-taking strategies.

#+begin_src emacs-lisp

    (use-package org-roam
      :straight t
      :custom
      (org-roam-node-display-template (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
      (org-roam-directory "~/Documents/Notes")
      (org-roam-capture-templates
       '(("d" "default" plain
          "%?"
          :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+STARTUP: latexpreview inlineimages\n#+date: %U\n")
          :unnarrowed t)
         ("1" "databases" plain
          "%?"
          :if-new (file+head "IFT-2935/%<%Y%m%d%H%M%S>-${slug}.org"
                             "#+title: ift2935-${title}\n#+STARTUP: latexpreview inlineimages\n#+date: %U\n")
          :unnarrowed t)
         ("2" "operating system" plain
          "%?"
          :if-new (file+head "IFT-2245/%<%Y%m%d%H%M%S>-${slug}.org"
                             "#+title: ift2245-${title}\n#+STARTUP: latexpreview inlineimages\n#+date: %U\n")
          :unnarrowed t)
         ("3" "software analysis" plain
          "%?"
          :if-new (file+head "IFT-6755/%<%Y%m%d%H%M%S>-${slug}.org"
                             "#+title: ift6755-${title}\n#+STARTUP: latexpreview inlineimages\n#+date: %U\n")
          :unnarrowed t)
         ("4" "logic 2" plain
          "%?"
          :if-new (file+head "PHI-2005/%<%Y%m%d%H%M%S>-${slug}.org"
                             "#+title: phi2005-${title}\n#+STARTUP: latexpreview inlineimages\n#+date: %U\n")
          :unnarrowed t)
         ("5" "demo2015" plain
          "%?"
          :if-new (file+head "Demo/IFT-2015/%<%Y%m%d%H%M%S>-${slug}.org"
                             "#+title: demo2015-${title}\n#+STARTUP: latexpreview inlineimages\n#+date: %U\n")
          :unnarrowed t)
         ("6" "demo1215" plain
          "%?"
          :if-new (file+head "Demo/IFT-1215/%<%Y%m%d%H%M%S>-${slug}.org"
                             "#+title: demo1215-${title}\n#+STARTUP: latexpreview inlineimages\n#+date: %U\n")
          :unnarrowed t)
         ("7" "demo1227" plain
          "%?"
          :if-new (file+head "Demo/IFT-1227/%<%Y%m%d%H%M%S>-${slug}.org"
                             "#+title: demo1227-${title}\n#+STARTUP: latexpreview inlineimages\n#+date: %U\n")
          :unnarrowed t)))

      :config
      (org-roam-setup))

#+end_src

*** Package | org-fragtog

Allows display of latex fragments in org files.

#+begin_src emacs-lisp

  (use-package org-fragtog
    :hook (org-mode . org-fragtog-mode))

#+end_src

*** Package | visual-fill-column

Allows line soft-wrap in org files.

#+begin_src emacs-lisp

  ;; Turns soft wrap on
  (defun pg/org-mode-visual-fill ()
    (setq visual-fill-column-width 150
          visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :hook ((org-mode gfm-view-mode) . pg/org-mode-visual-fill))

#+end_src

*** UI customization

Various improvements to the UI look in org files.

#+begin_src emacs-lisp

  (font-lock-add-keywords 'org-mode ; Replace '-' with bullets
                          '(("^ *\\([-]\\) "
                             (0 (prog1 () (compose-region
                                           (match-beginning 1) (match-end 1) "•"))))))

  (require 'org-indent) ; Changes some org structures to fixed pitch
  (set-face-attribute 'org-block nil :foreground nil :background "gray5" :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil :foreground "orange" :inherit 'fixed-pitch)
  (set-face-attribute 'org-verbatim nil :foreground "green" :inherit 'fixed-pitch)
  (set-face-attribute 'org-table nil :foreground "thistle3" :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)

  (dolist (face '((org-level-1 . 1.2) ; Sets font for variable-pitch text
                  (org-level-2 . 1.1)
                  (org-level-3 . 1.05)
                  (org-level-4 . 1.0)
                  (org-level-5 . 1.1)
                  (org-level-6 . 1.1)
                  (org-level-7 . 1.1)
                  (org-level-8 . 1.1)))
    (set-face-attribute (car face) nil :font "DejaVu Sans" :weight 'regular :height (cdr face)))

#+end_src

*** Code blocks

Customizes behaviour of code blocks. Some useful constructs to know:
- ~#+PROPERTY: header-args: emacs-lisp~ - Sets a property to code blocks to have their header args be defined as indicated.
- ~#+NAME: code-block-name~ - Gives a name to a code block.
- ~:noweb yes/no~ - Used for source blocks to allow them to use values outputted by other source blocks.
- ~:mkdir p yes/no~ - Allows code blocks to create directories.

#+begin_src emacs-lisp

  (with-eval-after-load 'org ; Defer the body code until org is loaded
    (org-babel-do-load-languages ; Loads languages to be executed by org-babel
     'org-babel-load-languages '((emacs-lisp . t)
                                 (java . t)
                                 (shell . t)
                                 (plantuml . t)
                                 ;; (jupyter . t)
                                 (python . t)))

    (setq org-confirm-babel-evaluate nil)

    (require 'org-tempo) ; Allows defined snippets to expand into appropriate code blocks
    (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
    (add-to-list 'org-structure-template-alist '("java" . "src java"))
    (add-to-list 'org-structure-template-alist '("als" . "src alloy"))
    (add-to-list 'org-structure-template-alist '("puml" . "src plantuml"))
    (add-to-list 'org-structure-template-alist '("vhd" . "src vhdl"))
    (add-to-list 'org-structure-template-alist '("asm" . "src mips"))
    (add-to-list 'org-structure-template-alist '("cc" . "src c"))
    (add-to-list 'org-structure-template-alist '("smv" . "src smv"))
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("py" . "src python"))
    (add-to-list 'org-structure-template-alist '("sql" . "src sql"))

    (add-to-list 'org-src-lang-modes '("als" . alloy))
    (add-to-list 'org-src-lang-modes '("smv" . nusmv))
    (add-to-list 'org-src-lang-modes '("plantuml" . plantuml)))

#+end_src

