.emacs.d/init.el

(defun pg/org-babel-tangle-config () ; Automatic tangle of emacs config file
  ;; (when (string-equal (file-name-directory (buffer-file-name))
  ;;                     (expand-file-name "~/.emacs.d/"))
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle)))

(add-hook 'org-mode-hook (lambda ()
                           (add-hook 'after-save-hook #'pg/org-babel-tangle-config)))

(defun pg/start-timer ()
  (interactive)
  (setq org-clock-sound "~/Misc/ding.wav")
  (pg/study-timer))

(defun pg/start-with-break-timer () ;; For Minyi
  (interactive)
  (setq org-clock-sound "~/Misc/ding.wav")
  (pg/break-timer))

(defun pg/stop-timer ()
  (interactive)
  (setq org-clock-sound nil)
  (remove-hook 'org-timer-done-hook #'pg/study-timer)
  (remove-hook 'org-timer-done-hook #'pg/break-timer)
  (org-timer-stop))

(defun pg/study-timer ()
  (add-hook 'org-timer-done-hook #'pg/break-timer)
  (remove-hook 'org-timer-done-hook #'pg/study-timer)
  (setq org-timer-default-timer "1:00:00")
  (setq current-prefix-arg '(4)) ; Universal argument
  (call-interactively #'org-timer-set-timer))

(defun pg/break-timer ()
  (add-hook 'org-timer-done-hook #'pg/study-timer)
  (remove-hook 'org-timer-done-hook #'pg/break-timer)
  (setq org-timer-default-timer "15:00")
  (setq current-prefix-arg '(4)) ; Universal argument
  (call-interactively #'org-timer-set-timer))

(use-package doc-view
  :straight nil
  :mode ("\\.djvu\\'" . doc-view-mode))

(use-package pdf-tools
  :straight t
  :mode ("\\.pdf\\'" . pdf-view-mode)
  :custom
  (pdf-misc-print-programm "/usr/bin/lpr")
  (pdf-misc-print-programm-args '("-o sides=two-sided-long-edge")))

(use-package djvu)

(use-package ps-print
  :straight nil
  :bind
  (:map pdf-view-mode-map
        ("C-c C-p" . pdf-misc-print-document))
  :config
  (require 'pdf-misc)
  :custom ;; Printing double-sided
  (ps-lpr-switches '("-o sides=two-sided-long-edge"))
  (ps-spool-duplex t))

(unless pg/is-termux
  (use-package openwith
    :custom
    (large-file-warning-threshold nil)
    :config
    (setq openwith-associations
          (list
           (list
            (openwith-make-extension-regexp '("mpg" "mpeg" "mp4" "avi" "wmv" "mov" "flv" "ogm" "ogg" "mkv"))
            "mpv"
            '(file))
           (list
            (openwith-make-extension-regexp '("odt"))
            "libreoffice"
            '(file))))
    (openwith-mode 1)))

(use-package dtk
  :commands dtk
  :after evil-collection
  :config
  (evil-collection-define-key 'normal 'dtk-mode-map
    (kbd "C-j") 'dtk-forward-verse
    (kbd "C-k") 'dtk-backward-verse
    (kbd "C-f") 'dtk-forward-chapter
    (kbd "C-b") 'dtk-backward-chapter
    "q" 'dtk-quit
    "c" 'dtk-clear-dtk-buffer
    "s" 'dtk-search)
  :hook
  (dtk-mode . (lambda () (setq-local face-remapping-alist '((default (:height 1.5) variable-pitch)))))
  :custom
  (dtk-module "KJV")
  (dtk-module-category "Biblical Texts")
  (dtk-word-wrap t))

(use-package ledger-mode
  :straight t
  :mode "\\.dat\\'"
  :hook (ledger-mode . company-mode)
  :custom
  (ledger-reconcile-default-commodity "CAD")
  (ledger-binary-path "/usr/bin/ledger")
  (ledger-clear-whole-transaction t))

(use-package slack
  :commands slack-start
  :hook (slack-mode . company-mode)
  :config
  (slack-register-team :name "ift6755"
                       :default t
                       :token (pg/lookup-password :host "ift6755.slack.com"
                                                  :user "philippe.gabriel.1@umontreal.ca")
                       :cookie (pg/lookup-password :host "ift6755.slack.com"
                                                   :user "philippe.gabriel.1@umontreal.ca^cookie")
                       :subscribed-channels '((general questions random))
                       :modeline-enabled t)
  :custom
  (slack-buffer-emojify t)
  (slack-prefer-current-team t))

(use-package sx
  :commands sx-search)

(defun pg/wttrin-fetch-raw-string (query)
  "Get the weather information based on your QUERY."
  (let ((url-user-agent "curl"))
    (add-to-list 'url-request-extra-headers wttrin-default-accept-language)
    (with-current-buffer
        (url-retrieve-synchronously
         (concat "http://wttr.in/" query)
         (lambda (status) (switch-to-buffer (current-buffer))))
      (decode-coding-string (buffer-string) 'utf-8))))

(use-package wttrin
  :commands wttrin
  :config
  (fset #'wttrin-fetch-raw-string #'pg/wttrin-fetch-raw-string)
  :custom
  (wttrin-default-cities '("montreal"))
  (wttrin-default-accept-language '("Accept-Language" . "en-US")))

(defun pg/start-mpd ()
  "Start MPD, connects to it and syncs the metadata cache."
  (interactive)
  (shell-command "mpd")
  (pg/update-mpd-db)
  (fset #'evil-collection-simple-mpc-replace-main-view #'pg/evil-collection-simple-mpc-replace-main-view)
  (simple-mpc)
  (message "MPD Started!"))

(defun pg/kill-mpd ()
  "Stops playback and kill the music daemon."
  (interactive)
  (simple-mpc-quit)
  (call-process "killall" nil nil nil "mpd")
  (message "MPD Killed!"))

(defun pg/update-mpd-db ()
  "Updates the MPD database synchronously."
  (interactive)
  (call-process "mpc" nil nil nil "update")
  (message "MPD Database Updated!"))


(defun pg/evil-collection-simple-mpc-replace-main-view ()
  "Update main view to show keys in use with evil mode."
  (interactive)
  (when (string= (buffer-name) simple-mpc-main-buffer-name)
    (read-only-mode -1)
    (erase-buffer)
    (insert (propertize "* simple-mpc *\n\n"
                        'face 'simple-mpc-main-name)
            (propertize "   * controls\n" 'face 'simple-mpc-main-headers)
            "      * [p]lay/pause toggle\n"
            "      * [>] next track\n"
            "      * [<] previous track\n"
            "      * seek [f]orward\n"
            "      * seek [b]ackward\n"
            "      * [+] increase volume\n"
            "      * [-] decrease volume\n"
            "      * toggle [r]epeat mode\n"
            (propertize "\n   * playlist\n" 'face 'simple-mpc-main-headers)
            "      * view [c]urrent playlist\n"
            "      * [C]lear current playlist\n"
            "      * [S]huffle playlist\n"
            "      * [l]oad playlist\n"
            "      * [s]earch database\n"
            (propertize "\n   * misc\n" 'face 'simple-mpc-main-headers)
            "      * [q]uit")))

(use-package simple-mpc
  :commands simple-mpc
  :bind
  (:map simple-mpc-mode-map
        ("<normal-state> r" . simple-mpc-toggle-repeat))
  (:map simple-mpc-mode-map
        ("r" . simple-mpc-toggle-repeat))
  :custom
  (simple-mpc-playlist-format "#| [%id%] \t #| [%time%] \t #| [%file%]"))

(use-package sudoku
  :custom
  (sudoku-style 'unicode)
  (sudoku-level 'hard))

(use-package sokoban
  :bind
  (:map sokoban-mode-map
        ("<normal-state> h" . sokoban-move-left)
        ("<normal-state> l" . sokoban-move-right)
        ("<normal-state> k" . sokoban-move-up)
        ("<normal-state> j" . sokoban-move-down)))
